app/controllers/bookings_controller.rb

SELECT * FROM `bookings`
---
  def index
    @bookings = Booking.all

SELECT * FROM `bookings` WHERE (`bookings`.`id` = 1)
---
  def show
    @booking = Booking.find(params[:id])

SELECT * FROM `desks` WHERE (`desks`.`id` = 1)
SELECT * FROM `meeting_rooms` WHERE (`meeting_rooms`.`id` = 1)
INSERT INTO `bookings` (`end_at`, `updated_at`, `bookable_type`, `bookable_id`, `start_at`, `paid`, `user_id`, `created_at`) VALUES(NULL, '2010-01-09 21:32:47', NULL, NULL, NULL, NULL, NULL, '2010-01-09 21:32:47')
---
  def create
    @booking = Booking.new(params[:booking])
    @booking.user_id = current_user.id
    if params[:desk]
      date = DateTime.parse(params[:date][:chosen])
      @booking.start_at = DateTime.new(date.year,date.month,date.day,9)
      @booking.end_at = DateTime.new(date.year,date.month,date.day,17)
      @desk = Desk.find(params[:desk][:id])
      @booking.bookable = @desk
    end
    if params[:meeting_room]
      date = DateTime.parse(params[:date][:chosen])
      @booking.start_at = DateTime.new(date.year,date.month,date.day,9)
      @booking.end_at = DateTime.new(date.year,date.month,date.day,17)
      @meeting_room = MeetingRoom.find(params[:meeting_room][:id])
      @booking.bookable = @meeting_room
    end


    respond_to do |format|
      if @booking.save