app/controllers/desks_controller.rb

  def index
    @desks = Desk.all
---
SELECT * FROM `desks`

  def show
    @desk = Desk.find(params[:id])
---
SELECT * FROM "desks" WHERE ("desks"."id" = 2053932785)

  def edit
    @desk = Desk.find(params[:id])
---
SELECT * FROM "desks" WHERE ("desks"."id" = 2053932785)

  def create
    @desk = Desk.new(params[:desk])

    respond_to do |format|
      if @desk.save
---
INSERT INTO `desks` (`name`, `updated_at`, `non_member_price`, `location_id`, `description`, `member_price`, `created_at`) VALUES('Co-Working Desk 1', '2010-01-09 20:20:21', 20.0, 1, '', 17.5, '2010-01-09 20:20:21')

  def update
    @desk = Desk.find(params[:id])
---
SELECT * FROM "desks" WHERE ("desks"."id" = 2053932785)

  def destroy
    @desk = Desk.find(params[:id])
    @desk.destroy
---
SELECT * FROM "desks" WHERE ("desks"."id" = 2053932785)
DELETE FROM "desks" WHERE "id" = 2053932785