app/controllers/locations_controller.rb

  def index
    #@locations = Location.all
    @location = Location.find(1)
---
SELECT * FROM `locations` WHERE (`locations`.`id` = 1)

  def create
    @location = Location.new(params[:location])

    respond_to do |format|
      if @location.save
---
INSERT INTO `locations` (`name`, `city`, `lon`, `updated_at`, `postcode`, `description`, `phone`, `add1`, `lat`, `email`, `add2`, `created_at`) VALUES('FlyThe.Coop', 'Manchester', '', '2010-01-09 20:19:29', 'M14 7PG', '', '07811197374', '36-40 Edge Street', '', 'ben@flythe.coop', '', '2010-01-09 20:19:29')

  def update
    @location = Location.find(params[:id])

    respond_to do |format|
      if @location.update_attributes(params[:location])
---
SELECT * FROM "locations" WHERE ("locations"."id" = 2053932785)
UPDATE `locations` SET `description` = 'FlyThe.Coop exists to have a sustainable and creative active community of individuals, entrepreneurs and small businesses in the city centre, working together and sharing space for the purposes of collaboration, innovation and profit for the benefit of themselves, their communities and their industries.\r\n\r\nThis co-working co-operative will represent a range of creative and technical industries in the City, creating new possibilities for collaboration and partnerships.', `updated_at` = '2010-01-09 20:48:33' WHERE `id` = 1

  def destroy
    @location = Location.find(params[:id])
    @location.destroy
---
SELECT * FROM "locations" WHERE ("locations"."id" = 2053932785)
DELETE FROM "locations" WHERE "id" = 2053932785