app/controllers/meeting_rooms_controller.rb

  def index
    @meeting_rooms = MeetingRoom.all
---
SELECT * FROM `meeting_rooms`

  def show
    @meeting_room = MeetingRoom.find(params[:id])
---
SELECT * FROM "meeting_rooms" WHERE ("meeting_rooms"."id" = 2053932785)

  def edit
    @meeting_room = MeetingRoom.find(params[:id])
---
SELECT * FROM "meeting_rooms" WHERE ("meeting_rooms"."id" = 2053932785)

  def create
    @meeting_room = MeetingRoom.new(params[:meeting_room])

    respond_to do |format|
      if @meeting_room.save
---
INSERT INTO `meeting_rooms` (`name`, `updated_at`, `non_member_price`, `location_id`, `description`, `member_price`, `created_at`) VALUES('Break-Out Space', '2010-01-09 20:21:45', 20.0, 1, '', 17.5, '2010-01-09 20:21:45')

  def update
    @meeting_room = MeetingRoom.find(params[:id])
---
SELECT * FROM "meeting_rooms" WHERE ("meeting_rooms"."id" = 2053932785)

  def destroy
    @meeting_room = MeetingRoom.find(params[:id])
    @meeting_room.destroy
---
SELECT * FROM "meeting_rooms" WHERE ("meeting_rooms"."id" = 2053932785)
DELETE FROM "meeting_rooms" WHERE "id" = 2053932785